blog/substitution and environment model.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Substitution model and Environment model</title>
<meta name="generator" content="Org mode" />
<meta name="author" content=" Norris" />
<link rel="stylesheet" href="https://jgkamat.gitlab.io/src/jgkamat.css"/>
</head>
<body>
<div id="content">
<h1 class="title">Substitution model and Environment model</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org3819722">1. Substitution model</a></li>
<li><a href="#orgcb93665">2. Environment model</a>
<ul>
<li><a href="#orgbb217f7">2.1. Rule of Evaluation</a>
<ul>
<li><a href="#org01b5223">2.1.1. define a procedure</a></li>
<li><a href="#org34bc438">2.1.2. apply a procedure</a></li>
</ul>
</li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-org3819722" class="outline-2">
<h2 id="org3819722"><span class="section-number-2">1</span> Substitution model</h2>
<div class="outline-text-2" id="text-1">
<blockquote>
<p>
To apply a compound procedure to arguments, evaluate the body of the procedure with each formal parameter replaced by the corresponding argument.
</p>
</blockquote>

<p>
The premise of substitution model is that the procedure is just the code, so it can be replaced by the sub-codes.
</p>

<div class="org-src-container">
<pre class="src src-scheme">(sum-of-squares (+ a <span style="color: #BFEBBF;">1</span>) (* a <span style="color: #BFEBBF;">2</span>))
(+ (square <span style="color: #BFEBBF;">6</span>) (square <span style="color: #BFEBBF;">10</span>))
(+ (* <span style="color: #BFEBBF;">6</span> <span style="color: #BFEBBF;">6</span>) (* <span style="color: #BFEBBF;">10</span> <span style="color: #BFEBBF;">10</span>))
</pre>
</div>

<p>
However, the substitution model collapse when you bring set! to the procedure, in which what we need is environment model
</p>
</div>
</div>

<div id="outline-container-orgcb93665" class="outline-2">
<h2 id="orgcb93665"><span class="section-number-2">2</span> Environment model</h2>
<div class="outline-text-2" id="text-2">
<p>
In environment model, a variable can no longer be considered to be merely a name for the value, but a storage which can be changed.
</p>

<p>
So we say that a procedure = code + environment, so we cannot just substitute code without taking environment into account.
</p>
</div>

<div id="outline-container-orgbb217f7" class="outline-3">
<h3 id="orgbb217f7"><span class="section-number-3">2.1</span> Rule of Evaluation</h3>
<div class="outline-text-3" id="text-2-1">
</div>
<div id="outline-container-org01b5223" class="outline-4">
<h4 id="org01b5223"><span class="section-number-4">2.1.1</span> define a procedure</h4>
<div class="outline-text-4" id="text-2-1-1">
<p>
How procedures are created? Define a procedure is defining a procedure object, because procedure definition is a syntax sugar
</p>

<div class="org-src-container">
<pre class="src src-scheme">(<span style="color: #F0DFAF; font-weight: bold;">define</span> (<span style="color: #93E0E3;">square</span> x)
  (* x x))
</pre>
</div>

<div class="org-src-container">
<pre class="src src-scheme">(<span style="color: #F0DFAF; font-weight: bold;">define</span> <span style="color: #93E0E3;">square</span>
  (<span style="color: #F0DFAF; font-weight: bold;">lambda</span> (x) (* x x)))
</pre>
</div>

<p>
and a procedure object = code + env(wrapping the def)
</p>

<pre class="example">
global   _________________________________
env  --&gt;|                                 | 
        | square : *                      |
         -------|------------------------
                |          ^
                |          |
                |          |
              ( *, *-)------
                            
         parameter: x
         body: (* x x)    
</pre>
</div>
</div>


<div id="outline-container-org34bc438" class="outline-4">
<h4 id="org34bc438"><span class="section-number-4">2.1.2</span> apply a procedure</h4>
<div class="outline-text-4" id="text-2-1-2">
<p>
When a procedure is applied, it will form a new environment with a frame binding parameter to arguments, and the frame makes a closing by pointing to the environment defines the procedure.
</p>

<pre class="example">
         _________________________________ 
env  --&gt;|                                 |
        | square : *                      |
         -------|-----------------------^-
                |                       |
                |                -------Frame 0-
                |               | x  : 30       |
              ( *, *-)---------&gt;|               |
                                |               |&lt;- E0
                                |               |
                                 ---------------

</pre>
</div>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">

<div>
<p class="author">Author: <a href="https://gitlab.com/jgkamat/jgkamat.gitlab.io"> Norris</a></p>
<p class="date">Published: </p>
<p class="creator"><a href="https://www.gnu.org/software/emacs/">Emacs</a> 26.1 (<a href="https://orgmode.org">Org</a> mode 9.3.1)</p>
</div>
</div>
</body>
</html>
